---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AttachedGroupNoMirror
source: html/fc41074b-6416-0992-bd76-9c7418887e8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AttachedGroupNoMirror Property

Attached detail groups cannot be mirrored without also mirroring their parent group.

## Syntax (C#)
```csharp
public static FailureDefinitionId AttachedGroupNoMirror { get; }
```